app/controllers/clicks_controller.rb

  def index
    max_date = Click.maximum('duration')
---
SELECT * FROM "clicks"

  def show
    @clicks = Click.find(params[:id])
---
SELECT * FROM "clicks" WHERE ("clicks"."id" = 1)

  def edit
    @clicks = Click.find(params[:id])
---
SELECT * FROM "clicks" WHERE ("clicks"."id" = 1)

  def create
    @clicks = Click.new(params[:click])

    respond_to do |format|
      if @clicks.save
---
INSERT INTO "clicks" ("duration", "created_at", "updated_at", "type_id") VALUES(NULL, '2009-07-20 16:24:49', '2009-07-20 16:24:49', NULL)

  def update
    @clicks = Click.find(params[:id])

    respond_to do |format|
      if @clicks.update_attributes(params[:click])
---
SELECT * FROM "clicks" WHERE ("clicks"."id" = 1)
UPDATE "clicks" SET "updated_at" = '2009-07-20 16:30:19', "duration" = '2009-07-20 16:30:00', "type_id" = 1 WHERE "id" = 1

  def get_range
    require 'time'
    start_date = Time.parse params["start_date"]
    end_date = Time.parse params["end_date"]
    @results = Click.find(get_result_ids(start_date, end_date, 300, false) + get_result_ids(start_date, end_date, 100, true))

puts @results.size.to_s
---
SELECT id FROM "clicks" WHERE (created_at > '2009-06-01 00:00:00' and created_at < '2009-09-06 00:00:00')
SELECT * FROM "clicks"